# Функция hash() и hash объектов ООП
# Python встроенные неизменяемые объекты, такие как строки или целые числа, хешируются, тогда как изменяемые контейнеры, такие как наборы, списки или словари, — нет 
# hash(123)-> 123
# hash((1,2,3))-> 529344067295497451
# ERROR! unhashable type :'set', 'list','dict' и т.д.

#Свойства:
#1) Если объекты равны (а==b), то и hash(a)==hash(b)
#2) Если хэши не равны hash(a)!=hash(b), то 100% объекты не равны a!=b
#3) Если хэши равны - это не значит что объекты равны, но как правило.

#Ключи в словаре хранятся (hash(key),key:значение) - при поиске и сравнении - сначала сравнивается хэш потом значения ключа

# Вычисление hash для объектов класса () и вычисление hash от значений объекта


class Point:
    def __init__(self,x,y):
        self.x = x 
        self.y = y
    
#    def __eq__(self,other):
#        return self.x == other.x and self.y == other.y
    
    def __hash__(self):
        return hash((self.x,self.y)) # хэш от кортежа координат, при переопределении метода  __eq__


p1 = Point(1,2)
p2 = Point(1,2)

print(hash(p1),hash(p2),sep='\n') 
print(hash(123),hash('123'),sep='\n')
print(hash('123'))
